DataProcessors/ОтправкаПродажОстатковПоMAHLE_И_KNECHT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтправкаПродажОстатковПоMAHLE_И_KNECHT</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаFTP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТестовыйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ОтправкаПродажОстатковПоMAHLE_И_KNECHT/Ext/ObjectModule.bsl
Функция ВыполнитьВыгрузкуПродажПоKAYABA(ДатаОтчета) Экспорт   
	//
	
	Город = Константы.Город.Получить();
	Если   Город = "" Тогда 
		ЗаписьЖурналаРегистрации("Не заполнены данные для выгрзки данных для брэнда ""KAYABA""");
		Возврат "";
		
	КонецЕсли;
	Склад = Константы.Склад.Получить();
	
	Текст = Новый ТекстовыйДокумент;
	Разделитель = ";";
	
	ПрефиксБазы = ВернутьПрефиксБазы();
	
	//------------------------
	// первая строка в формате ИНН дистрибутора (филиала), дата отчета, 0
	// 7701302972 ИНН Москворечье Трейдинг
	
	Текст.ДобавитьСтроку("7701302972"+Разделитель+
	СтрЗаменить(Год(ДатаОтчета),Символы.НПП,"")+Прав("0"+Месяц(ДатаОтчета),2)+Прав("0"+День(ДатаОтчета),2)+Разделитель+
	0);    
	
	//------------------------
	// вторая строка формат : 
	//ГородСклад
	//Склад
	//Клиент
	//ФормаСобственности
	//Топ
	//ТипКлиента
	//Регион
	//Город
	//Артикул
	//КоличествоПродано
	
	Текст.ДобавитьСтроку(
	"ГородСклад"+Разделитель+
	"Склад"+Разделитель+
	"Клиент"+Разделитель+
	"ФормаСобственности"+Разделитель+
	"Топ"+Разделитель+
	"ТипКлиента"+Разделитель+
	"Регион"+Разделитель+
	"Город"+Разделитель+
	"Артикул"+Разделитель+
	"КоличествоПродано"+Разделитель);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.Контрагент,
	|	ПродажиОбороты.ДокументПродажи.Грузополучатель КАК Грузополучатель,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ Продажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&НачДня,
	|			&ОкончаниеДня,
	|			Авто,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					Номенклатура.Ссылка
	|				ИЗ
	|					Справочник.Номенклатура КАК Номенклатура
	|				ГДЕ
	|					(  УсловиеКаяба  ))) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.КоличествоОборот <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Контрагент,
	|	ПродажиОбороты.ДокументПродажи.Грузополучатель,
	|	ПродажиОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.Номенклатура.КодПроизводителя КАК Артикул,
	|	Продажи.Контрагент КАК Контрагент,
	|	СУММА(Продажи.КоличествоОборот) КАК Количество,
	|	ЕСТЬNULL(КонтактнаяИнформация.Поле2, """") КАК РегионКлиента,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ПОДСТРОКА(КонтактнаяИнформация.Поле4, 1, 100) = """"
	|				ТОГДА КонтактнаяИнформация.Поле5
	|			ИНАЧЕ КонтактнаяИнформация.Поле4
	|		КОНЕЦ, """") КАК ГородКлиента,
	|	ЕСТЬNULL(КонтрагентыВидыДеятельностиДляПроизводителя.ВидДеятельности.КодДляСинхронизации, """") КАК ВидДеятельности,
	|	ЕСТЬNULL(КонтактнаяИнформацияГрузополучателя.Поле2, """") КАК РегионГрузополучателя,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ПОДСТРОКА(КонтактнаяИнформацияГрузополучателя.Поле4, 1, 100) = """"
	|				ТОГДА КонтактнаяИнформацияГрузополучателя.Поле5
	|			ИНАЧЕ КонтактнаяИнформацияГрузополучателя.Поле4
	|		КОНЕЦ, """") КАК ГородГрузополучателя,
	|	ЕСТЬNULL(ГрузополучателиВидыДеятельностиДляПроизводителя.ВидДеятельности.КодДляСинхронизации, """") КАК ВидДеятельностиГрузополучателя
	|ПОМЕСТИТЬ ТаблицаДанных
	|ИЗ
	|	Продажи КАК Продажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО Продажи.Контрагент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ВидыДеятельностиДляПроизводителя КАК КонтрагентыВидыДеятельностиДляПроизводителя
	|		ПО Продажи.Контрагент = КонтрагентыВидыДеятельностиДляПроизводителя.Ссылка
	|			И (КонтрагентыВидыДеятельностиДляПроизводителя.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияГрузополучателя
	|		ПО Продажи.Грузополучатель = КонтактнаяИнформацияГрузополучателя.Объект
	|			И (КонтактнаяИнформацияГрузополучателя.Тип = ЗНАЧЕНИЕ(перечисление.типыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияГрузополучателя.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ВидыДеятельностиДляПроизводителя КАК ГрузополучателиВидыДеятельностиДляПроизводителя
	|		ПО Продажи.Грузополучатель = ГрузополучателиВидыДеятельностиДляПроизводителя.Ссылка
	|			И (ГрузополучателиВидыДеятельностиДляПроизводителя.НомерСтроки = 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Номенклатура,
	|	ЕСТЬNULL(КонтактнаяИнформацияГрузополучателя.Поле2, """"),
	|	ЕСТЬNULL(ГрузополучателиВидыДеятельностиДляПроизводителя.ВидДеятельности.КодДляСинхронизации, """"),
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ПОДСТРОКА(КонтактнаяИнформация.Поле4, 1, 100) = """"
	|				ТОГДА КонтактнаяИнформация.Поле5
	|			ИНАЧЕ КонтактнаяИнформация.Поле4
	|		КОНЕЦ, """"),
	|	ЕСТЬNULL(КонтактнаяИнформация.Поле2, """"),
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ПОДСТРОКА(КонтактнаяИнформацияГрузополучателя.Поле4, 1, 100) = """"
	|				ТОГДА КонтактнаяИнформацияГрузополучателя.Поле5
	|			ИНАЧЕ КонтактнаяИнформацияГрузополучателя.Поле4
	|		КОНЕЦ, """"),
	|	ЕСТЬNULL(КонтрагентыВидыДеятельностиДляПроизводителя.ВидДеятельности.КодДляСинхронизации, """"),
	|	Продажи.Контрагент,
	|	Продажи.Номенклатура.КодПроизводителя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.Номенклатура,
	|	ТаблицаДанных.Артикул,
	|	ТаблицаДанных.Контрагент,
	|	ТаблицаДанных.Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаДанных.РегионКлиента, """") <> """"
	|			ТОГДА ТаблицаДанных.РегионКлиента
	|		ИНАЧЕ ТаблицаДанных.РегионГрузополучателя
	|	КОНЕЦ КАК РегионКлиента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаДанных.РегионКлиента, """") <> """"
	|				И ЕСТЬNULL(ТаблицаДанных.ГородКлиента, """") <> """"
	|			ТОГДА ТаблицаДанных.ГородКлиента
	|		ИНАЧЕ ТаблицаДанных.ГородГрузополучателя
	|	КОНЕЦ КАК ГородКлиента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаДанных.ВидДеятельности, """") <> """"
	|			ТОГДА ТаблицаДанных.ВидДеятельности
	|		ИНАЧЕ ТаблицаДанных.ВидДеятельностиГрузополучателя
	|	КОНЕЦ КАК ВидДеятельности
	|ИЗ
	|	ТаблицаДанных КАК ТаблицаДанных
	|АВТОУПОРЯДОЧИВАНИЕ";
//MAHLE и KNECHT	
	ГруппаКаяба = Справочники.Номенклатура.НайтиПоНаименованию("MAHLE",Истина); 
	ГруппаКаяба2 = Справочники.Номенклатура.НайтиПоНаименованию("KNECHT",Истина); 
	
	НЕНайденаКаяба = ГруппаКаяба.Пустая() И  ГруппаКаяба2.Пустая();
	
	Если НЕНайденаКаяба Тогда 
		Возврат "Не найдена номенклатура, относящаяся к MAHLE и KNECHT.";
	КонецЕсли;
	
	УсловиеКаяба = "";
	Если НЕ ГруппаКаяба.Пустая() Тогда 
		Запрос.УстановитьПараметр("MAHLE", ГруппаКаяба ); 
		УсловиеКаяба = "Номенклатура.Ссылка В ИЕРАРХИИ (&MAHLE)";
	КонецЕсли;
	
	Если НЕ ГруппаКаяба2.Пустая() Тогда
		Запрос.УстановитьПараметр("KNECHT", ГруппаКаяба2 );
		УсловиеКаяба = ?(УсловиеКаяба = ""," Номенклатура.Ссылка В ИЕРАРХИИ (&KNECHT) ", УсловиеКаяба+" ИЛИ "+" Номенклатура.Ссылка В ИЕРАРХИИ (&KNECHT) ");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"УсловиеКаяба", УсловиеКаяба);
	
	Запрос.УстановитьПараметр("НачДня", НачалоГода(ДатаОтчета));
	Запрос.УстановитьПараметр("ОкончаниеДня", КонецДня(ДатаОтчета));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		//------------------------
		// третья и последующие строки 
		//НазваниеБазы = Константы.База.Получить();
		НазваниеБазы =  Город;
		Если НЕ ЗначениеЗаполнено(НазваниеБазы) Тогда 
			Возврат "Неизвестно название базы ";
		КонецЕсли;
		//ГородФилиала = Строка(НазваниеБазы);
		ГородФилиала  = НазваниеБазы ;
		Выборка = РезультатЗапроса.Выбрать();
		
		ТекКонтрагент = "";
		КлиентПоСчету = 0 ;
		Пока Выборка.Следующий() Цикл
			
			Если ТекКонтрагент <> Выборка.Контрагент Тогда 
				КлиентПоСчету = КлиентПоСчету+1;
				ТекКонтрагент = Выборка.Контрагент;
			КонецЕсли;
			
			Подстрока = 
			ГородФилиала+Разделитель+Склад
			+Разделитель
			+"Клиент"+Строка(КлиентПоСчету)+Разделитель;
			//		+Выборка.Контрагент.Наименование+Разделитель
			
			
			
			Если ЭтоТестовыйРежим Тогда 
				Подстрока = Подстрока 
				+Выборка.Контрагент.Наименование+Разделитель ;
			КонецЕсли;
			
			Подстрока = Подстрока +
			+"0"+Разделитель
			+"0"+Разделитель
			+Выборка.ВидДеятельности+Разделитель
			+Выборка.РегионКлиента  +Разделитель
			+СтрЗаменить(Выборка.ГородКлиента," г", "") +Разделитель
			+Выборка.Артикул +Разделитель ;
			
			Если ЭтоТестовыйРежим Тогда 
				Подстрока = Подстрока 
				+Выборка.Номенклатура.Наименование +Разделитель
				+Выборка.Номенклатура.Родитель.Наименование +Разделитель;
			КонецЕсли;
			
			Подстрока = Подстрока +
			+Выборка.Количество;
			
			Текст.ДобавитьСтроку(Подстрока);
		КонецЦикла;
		
		//Иначе
		//	Возврат "Нет продаж за выбранный интервал";
	КонецЕсли;
	
	Если НаFTP Тогда 
		
		ИмяФайла = СтрЗаменить("SALES_ПрефиксБазы_UP.csv", "_ПрефиксБазы_", ПрефиксБазы);
		
		Текст.Записать(КаталогВременныхФайлов()+ИмяФайла);
		Попытка
			Соединение = Новый FTPСоединение(АдресFTP, ПортFTP, ЛогинFTP, ПарольFTP, ,Истина);
		Исключение
			Возврат "Не удалось соединиться с FTP сервером.";
		КонецПопытки;
		Соединение.Записать(КаталогВременныхФайлов()+ИмяФайла,ИмяФайла); 
	Иначе 
		Текст.Записать(Лев(ФайлВыгрузки, СтрДлина(ФайлВыгрузки)-4)+ПрефиксБазы+".csv");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВыполнитьВыгрузкуОстатковПоKAYABA(ДатаОтчета) Экспорт  
	
	Город = Константы.Город.Получить();
	Если   Город = "" Тогда 
		ЗаписьЖурналаРегистрации("Не заполнены данные для выгрзки данных для брэнда ""MAHLE и KNECHT""");
		Возврат "";
		
	КонецЕсли;
	Склад = Константы.Склад.Получить();
	
	
	
	
	Текст = Новый ТекстовыйДокумент;
	Разделитель = ";";
	
	ПрефиксБазы = ВернутьПрефиксБазы();
	
	//------------------------
	// первая строка в формате строка: ИНН дистрибутора (филиала), дата отчета, 1
	// 7701302972 ИНН Москворечье Трейдинг
	Текст.ДобавитьСтроку("7701302972"+Разделитель+
	СтрЗаменить(Год(ДатаОтчета),Символы.НПП,"")+Прав("0"+Месяц(ДатаОтчета),2)+Прав("0"+День(ДатаОтчета),2)+Разделитель+
	1);    
	
	//------------------------
	// вторая строка формат : 
	//Город
	//Склад
	//Артикул
	//КоличествоОстаток
	
	
	Текст.ДобавитьСтроку(
	"Город"+Разделитель+
	"Склад"+Разделитель+
	"Артикул"+Разделитель+
	"КоличествоОстаток"+Разделитель);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОрганизацийОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыОрганизацийОстатки.Номенклатура.КодПроизводителя КАК Артикул,
	|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(
	|			&ДатаОстатка,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					Номенклатура.Ссылка
	|				ИЗ
	|					Справочник.Номенклатура КАК Номенклатура
	|				ГДЕ
	|					(  УсловиеКаяба ))) КАК ТоварыОрганизацийОстатки
	|ГДЕ
	|	ТоварыОрганизацийОстатки.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	//MAHLE и KNECHT
	
	ГруппаКаяба = Справочники.Номенклатура.НайтиПоНаименованию("MAHLE",Истина); 
	ГруппаКаяба2 = Справочники.Номенклатура.НайтиПоНаименованию("KNECHT",Истина); 
	
	НЕНайденаКаяба = ГруппаКаяба.Пустая() И  ГруппаКаяба2.Пустая();
	
	Если НЕНайденаКаяба Тогда 
		Возврат "Не найдена номенклатура, относящаяся к MAHLE и KNECHT.";
	КонецЕсли;
	
	УсловиеКаяба = "";
	Если НЕ ГруппаКаяба.Пустая() Тогда 
		Запрос.УстановитьПараметр("MAHLE", ГруппаКаяба ); 
		УсловиеКаяба = "Номенклатура.Ссылка В ИЕРАРХИИ (&MAHLE)";
	КонецЕсли;
	
	Если НЕ ГруппаКаяба2.Пустая() Тогда
		Запрос.УстановитьПараметр("KNECHT", ГруппаКаяба2 );
		УсловиеКаяба = ?(УсловиеКаяба = ""," Номенклатура.Ссылка В ИЕРАРХИИ (&KNECHT) ", УсловиеКаяба+" ИЛИ "+" Номенклатура.Ссылка В ИЕРАРХИИ (&KNECHT) ");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"УсловиеКаяба", УсловиеКаяба);
	
	Запрос.УстановитьПараметр("ДатаОстатка", КонецДня(ДатаОтчета));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		//------------------------
		// третья и последующие строки 
		//НазваниеБазы = Константы.База.Получить();
		НазваниеБазы = Город;
		Если НЕ ЗначениеЗаполнено(НазваниеБазы) Тогда 
			Возврат "Неизвестно название базы ";
		КонецЕсли;
		//ГородФилиала = Строка(НазваниеБазы);
		ГородФилиала  =  НазваниеБазы;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Подстрока = 
			ГородФилиала+Разделитель+Склад
			+Разделитель
			+Выборка.Артикул +Разделитель ;
			
			Если ЭтоТестовыйРежим Тогда 
				Подстрока = Подстрока 
				+Выборка.Номенклатура.Наименование +Разделитель
				+Выборка.Номенклатура.Родитель.Наименование +Разделитель;
			КонецЕсли;
			
			Подстрока = Подстрока +
			+Выборка.КоличествоОстаток;
			
			Текст.ДобавитьСтроку(Подстрока);
		КонецЦикла;
		
		//Иначе
		//	Возврат "Нет остатков за выбранный интервал";
	КонецЕсли;
	
	Если НаFTP Тогда 
		
		ИмяФайла = СтрЗаменить("STOCK_ПрефиксБазы_UP.csv", "_ПрефиксБазы_", ПрефиксБазы);
		
		Текст.Записать(КаталогВременныхФайлов()+ИмяФайла);
		Попытка
			Соединение = Новый FTPСоединение(АдресFTP, ПортFTP, ЛогинFTP, ПарольFTP, ,Истина);
		Исключение
			Возврат "Не удалось соединиться с FTP сервером.";
		КонецПопытки;
		Соединение.Записать(КаталогВременныхФайлов()+ИмяФайла,ИмяФайла); 
	Иначе 
		Текст.Записать(Лев(ФайлВыгрузки, СтрДлина(ФайлВыгрузки)-4)+ПрефиксБазы+".csv");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВернутьПрефиксБазы()
	
	ПрефиксБазы = "";
	Если Константы.База.Получить() = Перечисления.НазваниеБазы.Владимир Тогда 
		ПрефиксБазы = "VLD";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Самара Тогда 
		ПрефиксБазы = "SAM";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Рязань Тогда 
		ПрефиксБазы = "RZN";  
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Тула Тогда 
		ПрефиксБазы = "TUL";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Казань Тогда 
		ПрефиксБазы = "KZN";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Воронеж Тогда 
		ПрефиксБазы = "VRN";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Ярославль Тогда 
		ПрефиксБазы = "YAR";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Калуга Тогда 
		ПрефиксБазы = "KLG";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Молодогвардейская Тогда 
		ПрефиксБазы = "MOL";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.ЮГ Тогда 
		ПрефиксБазы = "UG";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Север Тогда 
		ПрефиксБазы = "SEV";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Тверь Тогда 
		ПрефиксБазы = "TVR";
	ИначеЕсли Константы.База.Получить() = Перечисления.НазваниеБазы.Восток Тогда 
		ПрефиксБазы = "VST";		
	КонецЕсли;
	
	Возврат ПрефиксБазы;
	
КонецФункции // ВернутьПрефиксБазы()()
